src/Catalogs/ВариантыБюджетов/ВариантыБюджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВариантыБюджетов</name>
  <predefined>
    <items>
      <name>БазовыйВариант</name>
      <description>Базовый вариант</description>
    </items>
  </predefined>
  <attributes>
    <name>НачалоПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДетальностьПланирования</name>
    <type>
      <types>EnumRef.ПериодичностьПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧислоМесяца</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерМесяца</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеДетальностиПланирования</name>
    <comment>(Инф.)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Активность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/ПоказателиБюджета/ПоказателиБюджета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПоказателиБюджета</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ВариантБюджета</name>
    <type>
      <types>CatalogRef.ВариантыБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НачалоПериода</name>
    <comment>Каелндарное начало периода, рассматриваемого в бюджете.</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>РазделБюджета</name>
    <type>
      <types>CatalogRef.ФинансовыеЦели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипПоказателя</name>
    <comment>(Инф.)</comment>
    <type>
      <types>EnumRef.ТипыБюджетныхПоказателей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГрафаБюджета</name>
    <type>
      <types>CatalogRef.ГрафыБюджета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяБюджета</name>
    <type>
      <types>DefinedType.СтатьяБюджета</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ПериодичностьПланирования/ПериодичностьПланирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПериодичностьПланирования</name>
  <enumValues>
    <name>Произвольно</name>
  </enumValues>
  <enumValues>
    <name>День</name>
  </enumValues>
  <enumValues>
    <name>Неделя</name>
  </enumValues>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
  <enumValues>
    <name>Квартал</name>
  </enumValues>
  <enumValues>
    <name>Год</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ВариантыБюджетов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Валюта = Константы.ВалютаУчета.Получить();
	ТекущаяДата = ТекущаяДатаСеанса();
	НачалоПланирования    = НачалоГода(?(Месяц(ТекущаяДата) < 2, ДобавитьМесяц(ТекущаяДата, -12), ТекущаяДата));
	Если НЕ ЗначениеЗаполнено(ДетальностьПланирования) Тогда
		ДетальностьПланирования = Перечисления.ПериодичностьПланирования.Месяц;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДетальностьПланирования) Тогда
		
		Если ДетальностьПланирования <> Перечисления.ПериодичностьПланирования.Неделя
			И ДетальностьПланирования <> Перечисления.ПериодичностьПланирования.Месяц
			И ДетальностьПланирования <> Перечисления.ПериодичностьПланирования.Квартал
			И ДетальностьПланирования <> Перечисления.ПериодичностьПланирования.Год Тогда
			ТекстСообщения = НСтр("ru = 'Указана некорректная детальность планирования. 
				|Допускается только одно из следующих значений: Неделя, Месяц, Квартал, Год'"); 
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , 
					"Объект.ДетальностьПланирования", , Отказ);
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Заполнение обязательных и информационных реквизитов
	Если ЧислоМесяца = 0 Тогда
		ЧислоМесяца = 1;
	ИначеЕсли ЧислоМесяца > 29 Тогда
		ЧислоМесяца = 29;
	КонецЕсли;
	
	Если НомерМесяца = 0 Тогда
		НомерМесяца = 1;
	ИначеЕсли ДетальностьПланирования = Перечисления.ПериодичностьПланирования.Квартал 
		И НомерМесяца > 3 Тогда
		НомерМесяца = 3;
	ИначеЕсли ДетальностьПланирования = Перечисления.ПериодичностьПланирования.Год 
		И НомерМесяца > 12 Тогда
		НомерМесяца = 12;
	КонецЕсли;
	
	ПредставлениеДетальностиПланирования = Строка(ДетальностьПланирования);
	Если ЧислоМесяца <> 1 Или НомерМесяца <> 1 Тогда
		СтрокаЧисла = "";
		Если ДетальностьПланирования = Перечисления.ПериодичностьПланирования.Месяц Тогда
			
			СтрокаЧисла = НСтр("ru='с %1-го числа'");
			СтрокаЧисла = СтрШаблон(СтрокаЧисла, ЧислоМесяца);
			
		ИначеЕсли ДетальностьПланирования = Перечисления.ПериодичностьПланирования.Квартал Тогда
			
			СтрокаЧисла = НСтр("ru='с %1, %2, %3, %4'");
			СтрокаЧисла = СтрШаблон(СтрокаЧисла, 
						Формат(Дата(2010, НомерМесяца, ЧислоМесяца), "ДФ='д ММММ'"),
						Формат(Дата(2010, НомерМесяца + 3, ЧислоМесяца), "ДФ='д ММММ'"),
						Формат(Дата(2010, НомерМесяца + 6, ЧислоМесяца), "ДФ='д ММММ'"),
						Формат(Дата(2010, НомерМесяца + 9, ЧислоМесяца), "ДФ='д ММММ'"));
			
		ИначеЕсли ДетальностьПланирования = Перечисления.ПериодичностьПланирования.Год Тогда
			
			СтрокаЧисла = НСтр("ru='с %1'");
			СтрокаЧисла = СтрШаблон(СтрокаЧисла, Формат(Дата(2010, НомерМесяца, ЧислоМесяца), "ДФ='д ММММ'") );
			
		КонецЕсли;
		
		Если СтрокаЧисла <> "" Тогда
			ПредставлениеДетальностиПланирования = ПредставлениеДетальностиПланирования + " (" 
					+ СтрокаЧисла + ")"; 
		КонецЕсли;
	
	КонецЕсли;
	
	ОтложеннаяЗапись = ДополнительныеСвойства.Свойство("ОтложеннаяЗапись");
	
	// Проверки перед записью
	ОбслуживаниеСправочников.ПроверкаИзмененияПредопределенныхЭлементовПередЗаписью(ЭтотОбъект, Отказ, "Наименование");
	Если Не Отказ И Не ОтложеннаяЗапись Тогда
		ОбслуживаниеСправочников.ПроверкаНаименованияСправочникаПередЗаписью(ЭтотОбъект, Отказ);
	КонецЕсли;
	Если Не Отказ И Не ОтложеннаяЗапись Тогда
		ОбслуживаниеСправочников.СогласованиеПометкиИАктивностиПередЗаписью(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ЗаписываетсяНовыйОбъект", Ссылка.Пустая());
	Если Не ДополнительныеСвойства.ЗаписываетсяНовыйОбъект Тогда
		ДополнительныеСвойства.Вставить("ПрежнееНачалоПлана", Ссылка.НачалоПланирования);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.ЗаписываетсяНовыйОбъект Тогда
		
		БюджетированиеСервер.ЗаполнитьВариантБюджетаСтатьямиПоУмолчанию(Ссылка);
		
	ИначеЕсли ДополнительныеСвойства.ПрежнееНачалоПлана > НачалоПланирования Тогда
		
		// Удаляем лишние периоды в плановых показателях бюджета
		УдлаитьЛишниеПоказателиБюджета();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура УдлаитьЛишниеПоказателиБюджета() 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВариантБюджета", Ссылка);
	Запрос.УстановитьПараметр("НачалоПериода",  НачалоПланирования);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоказателиБюджета.НачалоПериода КАК НачалоПериода,
	|	ПоказателиБюджета.ВариантБюджета,
	|	ПоказателиБюджета.РазделБюджета КАК РазделБюджета,
	|	ПоказателиБюджета.ТипПоказателя,
	|	ПоказателиБюджета.СтатьяБюджета,
	|	ПоказателиБюджета.ГрафаБюджета
	|ИЗ
	|	РегистрСведений.ПоказателиБюджета КАК ПоказателиБюджета
	|ГДЕ
	|	ПоказателиБюджета.ВариантБюджета = &ВариантБюджета
	|	И ПоказателиБюджета.НачалоПериода < &НачалоПериода
	|
	|УПОРЯДОЧИТЬ ПО
	|	РазделБюджета,
	|	НачалоПериода";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Запись = РегистрыСведений.ПоказателиБюджета.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.Удалить();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти



#КонецЕсли
